# 9.12.1 CSV files Practice and Self Check

In [1]:
import csv

In [4]:
with open('accounts.csv', mode='w', newline='') as accounts:
    writer = csv.writer(accounts)
    writer.writerow([100, 'Jones', 24.98])
    writer.writerow([200, 'Doe', 345.67])
    writer.writerow([300, 'White', 0.00])
    writer.writerow([400, 'Stone', -42.16])
    writer.writerow([500, 'Rich', 224.62])

In [7]:
with open('accounts.csv', 'r', newline='') as accounts:
    print(f'{"Accounts":<10}{"Name":<10}{"Balance":>10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:>10}')

Accounts  Name         Balance
100            Jones
200              Doe
300            White
400            Stone
500             Rich

In [10]:
with open('accounts.csv', 'r', newline='') as accounts:
    print(f'{"Account":<10}{"Name":<10}{"Balance":>10}')
    reader = csv.reader(accounts)
    for record in reader:
        account, name, balance = record
        print(f'{account:<10}{name:<10}{balance:>10}')

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

In [19]:
import csv

In [35]:
with open('grades.csv', mode='w', newline='') as grades:
    writer = csv.writer(grades)
    writer.writerow([1, 'Red', 'A'])
    writer.writerow([2, 'Green', 'B'])
    writer.writerow([3, 'White', 'A'])

In [36]:
with open('grades.csv', 'r', newline='') as grades:
    print(f'{"ID":<4}{"Name":<7}{"Grade"}')
    reader = csv.reader(grades)
    for record in reader:
          student_id, name, grade = record
          print(f'{student_id:<4}{name:<7}{grade}')

ID  Name   Grade
1   Red    A
2   Green  B
3   White  A

# 9.12.2 Practice

In [37]:
import pandas as pd

In [38]:
df = pd.read_csv('accounts.csv', names=['account', 'name', 'balance'])

In [39]:
df

   account   name  balance
0      100  Jones    24.98
1      200    Doe   345.67
2      300  White     0.00
3      400  Stone   -42.16
4      500   Rich   224.62

# Project 1

# 9.12.3 Practice

In [42]:
import pandas as pd

In [44]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [71]:
pd.set_option('display.precision', 2)

In [ ]:
### 'precision' is out of date in pandas. Now you must precede it with 'display.' ###

In [65]:
titanic.head()

                             names survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [66]:
titanic.tail()

                          names survived     sex   age class
1304       Zabour, Miss. Hileni       no  female  14.5   3rd
1305      Zabour, Miss. Thamine       no  female   NaN   3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5   3rd
1307        Zakarian, Mr. Ortin       no    male  27.0   3rd
1308         Zimmerman, Mr. Leo       no    male  29.0   3rd

In [67]:
titanic.columns = ['names', 'survived', 'sex', 'age', 'class']

In [68]:
titanic.head()

                             names survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

# 9.12.4 Practice

In [69]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [70]:
(titanic.survived =='yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

# 9.12.5 Practice and Self Check

In [3]:
import pandas as pd

In [14]:
%matplotlib

Using matplotlib backend: TkAgg

In [15]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [16]:
histogram = titanic.hist()

# Alex Ledgerwood